{
  "experience": [
    {
      "id": "smartmoving",
      "company": "SmartMoving Software",
      "title": "Senior Product Manager",
      "logo": "SmartMoving.png",
      "location": "Dallas, Texas, United States",
      "type": "Hybrid",
      "startDate": "Jan 2024",
      "endDate": "Present",
      "duration": "1 yr 3 mos",
      "description": "Lead product strategy for high-growth B2B SaaS platform, driving revenue growth through payments integration, AI-powered automation, and analytics solutions.",
      "achievements": [
        "Delivered $2M revenue ACH payments product in 8 months, becoming company's fastest-growing revenue stream",
        "Launched OpenAPI platform generating $350K ARR, enabling ecosystem expansion and third-party integrations",
        "Built analytics solution with $10K ARR personally sold, projecting 50% customer adoption within 12 months",
        "Achieved 30% adoption rate for automation framework in 12 weeks, with 4.5/5 customer satisfaction rating",
        "Conduct 20+ monthly customer interviews, creating data-driven product roadmap that increased feature adoption"
      ],
      "skills": [
        "Product Strategy",
        "Revenue Growth",
        "API Development", 
        "Payment Systems",
        "Customer Research",
        "B2B SaaS",
        "Analytics",
        "Automation"
      ]
    },
    {
      "id": "zebra",
      "company": "Zebra Technologies",
      "title": "Senior Product Manager",
      "logo": "zebra.jpg",
      "location": "Frisco, Texas, United States",
      "type": "Hybrid",
      "startDate": "Nov 2022",
      "endDate": "Jan 2024",
      "duration": "1 yr 3 mos",
      "description": "Spearheaded AI-powered retail inventory planning system for newly formed software business unit, establishing product operations and go-to-market strategy.",
      "achievements": [
        "Launched AI-driven inventory planning system delivering 45% improvement in planning accuracy for retail clients",
        "Designed specialized UI reducing planning decision-making overhead by 20%, streamlining operational workflows",
        "Established product operations framework for new software division, scaling from 0 to market-ready product",
        "Built foundational sales pipeline through strategic go-to-market coordination with sales and marketing teams",
        "Led cross-functional teams integrating API-based AI forecasting capabilities with seamless system integrations"
      ],
      "skills": [
        "AI/ML Integration",
        "Retail Technology",
        "Product Operations",
        "Go-to-Market Strategy",
        "API Integration",
        "UI/UX Design",
        "Forecasting",
        "Business Intelligence"
      ]
    },
    {
      "id": "koddi",
      "company": "Koddi",
      "title": "Product Manager",
      "logo": "koddi.png",
      "location": "Remote",
      "type": "Remote",
      "startDate": "Jun 2022",
      "endDate": "Dec 2022",
      "duration": "7 mos",
      "description": "Owned KoddiOne digital advertising platform, driving user experience improvements and operational efficiency through product optimization.",
      "achievements": [
        "Redesigned advertisement setup portal, boosting user satisfaction by 15% and reducing setup time",
        "Reduced product complexity by 20% through strategic engineering collaboration and process optimization",
        "Implemented standardized product operations pipeline, streamlining releases and automated documentation",
        "Enhanced platform performance through AI-driven recommendation features for enterprise advertising clients"
      ],
      "skills": [
        "Digital Advertising",
        "Platform Optimization",
        "User Experience",
        "Process Automation",
        "Engineering Collaboration",
        "Performance Optimization"
      ]
    },
    {
      "id": "firststudent",
      "company": "First Student",
      "title": "Product Manager",
      "logo": "first-student.jpg",
      "location": "Remote",
      "type": "Remote",
      "startDate": "Sep 2021",
      "endDate": "Jun 2022",
      "duration": "10 mos",
      "description": "Led product strategy for new special needs transportation vertical, managing technical architecture and team of 40+ contractors.",
      "achievements": [
        "Launched special needs transportation platform (2 web apps, 2 mobile apps) generating $1M initial revenue, scaling to $20M projected over 3 years",
        "Directed cross-functional team of 40+ contractors delivering innovative transportation management solutions",
        "Implemented AI-driven routing algorithms optimizing transportation efficiency and resource allocation",
        "Presented strategic updates to executive leadership and board of 70,000+ employee organization"
      ],
      "skills": [
        "Product Strategy",
        "Technical Architecture",
        "Transportation Technology",
        "AI Optimization",
        "Executive Presentations",
        "Large Team Leadership"
      ]
    },
    {
      "id": "ezlynx",
      "company": "EZLynx",
      "title": "Senior Business Analyst",
      "logo": "ezlynx.png",
      "location": "Lewisville, Texas, United States",
      "type": "On-site",
      "startDate": "Aug 2020",
      "endDate": "Sep 2021",
      "duration": "1 yr 2 mos",
      "description": "Developed third-party integration marketplace and product operations infrastructure for insurance software platform.",
      "achievements": [
        "Built API-based integration marketplace with 18 provider integrations, generating $350K revenue in 8 months",
        "Created comprehensive product operations pipeline integrating PowerBI, Jira, Freshdesk, and Salesforce",
        "Mentored 3 junior analysts, improving requirements consistency by 15% across development teams",
        "Managed development across 3 scrum teams with 15 total developers, ensuring coordinated delivery"
      ],
      "skills": [
        "API Integration",
        "Business Analysis",
        "Product Operations",
        "Revenue Generation",
        "Team Mentoring",
        "Scrum Management"
      ]
    },
    {
      "id": "innovation",
      "company": "Everdriven",
      "title": "Business Innovation Product Manager",
      "logo": "everdriven.jpg",
      "location": "McKinney, TX",
      "type": "On-site",
      "startDate": "Aug 2019",
      "endDate": "Aug 2020",
      "duration": "1 yr 1 mo",
      "description": "Established product management division and led transportation platform optimization through AI-powered solutions.",
      "achievements": [
        "Founded product management division by demonstrating strategic value to executive leadership team",
        "Optimized transportation management platform, reducing operational overhead by 31% through process improvements",
        "Pioneered geo-spatial AI algorithms improving routing efficiency and automated quoting accuracy",
        "Conducted extensive user research with school districts, informing customer-centric platform enhancements"
      ],
      "skills": [
        "Product Innovation",
        "Operations Optimization",
        "Geo-spatial AI",
        "Executive Leadership",
        "User Research",
        "Process Improvement"
      ]
    },
    {
      "id": "technical",
      "company": "Everdriven",
      "title": "Technical Product Manager",
      "logo": "everdriven.jpg",
      "location": "Colorado Springs, Colorado Area",
      "type": "On-site",
      "startDate": "Jun 2018",
      "endDate": "Aug 2019",
      "duration": "1 yr 3 mos",
      "description": "Led technical product development and engineering collaboration for transportation software solutions.",
      "achievements": [
        "Managed technical product roadmap and engineering implementation for core platform features",
        "Collaborated with development teams on REST API architecture and system integration requirements",
        "Established technical documentation standards and stakeholder communication processes",
        "Built strong engineering relationships facilitating efficient product development cycles"
      ],
      "skills": [
        "Technical Product Management",
        "REST APIs",
        "System Architecture",
        "Engineering Collaboration",
        "Documentation Standards"
      ]
    }
  ]
}